{
  "title": "Raw Socket",
  "language": "cpp",
  "topics": [
    "machine_learning",
    "web_dev",
    "fundamentals",
    "algorithms",
    "networking",
    "data_structures",
    "database"
  ],
  "purpose": "  👉 Explanation",
  "code": "In this C program, we use a raw socket to receive and read network packets. Let's break down the important parts of the code:\nHeader Files: \nThe necessary header files are included to access socket-related functions and structures.\nSocket Creation: \nThe socket() function is called to create a raw socket. The arguments passed are AF_INET (IPv4), SOCK_RAW (raw socket type), and IPPROTO_ICMP (the protocol we want to capture, in this case, ICMP). Raw sockets allow us to receive all packets of the specified protocol.\nPacket Reception: \nThe program enters a while loop to continuously read packets from the raw socket using the read() system call. The function reads up to 8192 bytes of data from the socket and stores it in the buff buffer.\nPacket Analysis: \nThe received packet is then treated as an IP packet. We cast the buffer buff to a pointer of type struct iphdr (IP header structure) named ip. This allows us to access the IP header fields directly.\nSource and Destination Printing: \nWe extract the source and destination IP addresses from the IP header using inet_ntoa, a function that converts IP addresses from binary to a readable string format. The extracted addresses are then printed to the console.\n\n\n🎯 Sample Output\n[root@localhost ~]# ./a.out\nSource: 172.16.29.123 \nDestnation: 172.16.29.60\nSource: 172.16.29.123 \nDestnation: 172.16.29.60\nSource: 172.16.29.123 \nDestnation: 172.16.29.60\nSource: 172.16.29.123 \nDestnation: 172.16.29.60\nSource: 172.16.29.123 \nDestnation: 172.16.29.60\nSource: 172.16.29.123 \nDestnation: 172.16.29.60\nSource: 172.16.29.123 \nDestnation: 172.16.29.60\n\n\n🎯 Summary\nIn this blog post, we explored the concept of raw sockets in Unix using C programming. We learned that raw sockets provide direct access to network protocols, allowing developers to handle IP packets at a low level. The C program provided reads ICMP packets from a raw socket and prints the source and destination IP addresses from each packet.\n\n\n🎯 Key Points\nRaw sockets offer direct access to network protocols at the network layer.\nThey are powerful tools for building custom protocols, network monitoring, and network security applications.\nThe C program demonstrated how to create and use a raw socket to read ICMP packets and extract IP addresses.\nLayer 2 Raw Socket Programming\nWe assume the environment introduced in the previous lecture. In this hands-on session, we will create data link raw sockets using Linux and Python 3 and try to send/receive data using sockets.\nHands-On with Sample Code\nStep 1. Preparation\nHere is the sample code. (This session is based on this Python sample code. If you prefer C language, please refer to the C version.)\nOpen the terminal and type:\n$ git clone https://github.com/y-sira/pyng.git\nYou can find network interface names and MAC addresses on your virtual machine using ip command as follows:\n$ ip link\n1: lo: <LOOPBACK,UP,LOWER_UP> mtu 65536 qdisc noqueue state UNKNOWN mode DEFAULT group default qlen 1000\n    link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00\n2: enp0s3: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc fq_codel state UP mode DEFAULT group default qlen 1000\n    link/ether 08:00:27:dd:d7:43 brd ff:ff:ff:ff:ff:ff\n3: enp0s8: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc fq_codel state UP mode DEFAULT group default qlen 1000\n    link/ether 08:00:27:b0:d6:ff brd ff:ff:ff:ff:ff:ff\n4: enp0s9: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc fq_codel state UP mode DEFAULT group default qlen 1000\n    link/ether 08:00:27:e6:4d:39 brd ff:ff:ff:ff:ff:ff\n5: enp0s10: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc fq_codel state UP mode DEFAULT group default qlen 1000\n    link/ether 08:00:27:8e:75:44 brd ff:ff:ff:ff:ff:ff\nPlease remember interface names and corresponding MAC addresses.\nStep 2. Start Packet Capture Using Wireshark\nOpen the terminal and type:\n$ sudo wireshark\nWireshark screen will be appeared.\n\nDouble click the interface name you want to monitor, then you can see packets sent to the interface.\n\nStep 3. Send/Receive Frames Using Layer 2 Raw Sockets\nMove to pyng directory and run the server script:\n$ cd /path/to/pyng\n$ sudo ./pyngd $SERVER_INTERFACE_NAME\nOpen another terminal, move to pyng directory, and run the client script to send the frame to the server:\n$ cd /path/to/pyng\n$ sudo ./pyng $DESTINATION_MAC_ADDRESS $CLIENT_INTERFACE_NAME\nSent!\nMake sure that the data client script sent is appeared in the server side terminal.\n\nStep 4. Check Frames with Wireshark\nStop packet capture. You can filter the packet by protocol, source address, destination address, …, etc. Please enter eth.type == 0x88b5 in the filter text box to check frames you sent.\n\nVerify the Ethernet header and the payload.\nStep 5. Considerations\nPlease consider below.\nWhat data is sent?\nWhy does the payload contain many zero?\nHow do we send/receive data in the sample code?\nWhat is struct.pack('!6s6sH', ...) in the server side script?\nWhat does the magic number 0x88b5 mean?\nWhat kinds of packets are displayed in Wireshark?\nWhat does the MAC address ff:ff:ff:ff:ff:ff mean?\nWhat is select in the server side sample code?\nWhy do not use recv() directly?\nHow can we handle massive requests?\n…\nFor Beginners\nSocket APIs\nThe socket APIs are APIs for interprocess communication and network communication from applications. It is available on UNIX and Linux. In Linux, it is easy to handle the data link layer by using the socket API. Let’s explain Linux sockets later.\nData Link Raw Sockets\nIn order to send and receive data using socket APIs, we have to generate a socket descriptor. The socket descriptor can be generated using int socket (int family, int type, int protocol) defined in sys/socket.h. The first argument family specifies the address family. For the data link layer, specify AF_PACKET defined in sys/socket.h. The second argument type specifies the socket type. For the data link layer, specify SOCK_RAW defined in sys/socket.h. The third argument protocol specifies the protocol. Specify ETH_P_ALL to retrieve any Ethernet frames, and specify ETH_P_IP to retrieve Ethernet frames containing a IP packet. The protocol types of the Ethernet frame is defined in linux/if_ether.h.\nIn Python, there is a standard library that wraps the OS level socket APIs, so we will use it to create a data link raw socket. Please be careful to close() after using the socket.\nimport socket\nETH_P_ALL = 3\ns = socket.socket(socket.AF_PACKET, socket.SOCK_RAW, socket.htons(ETH_P_ALL))\ns.close()\nWe use bind() to bind the network interface to the socket. You can check the network interface available on your computer with the following command.\n$ ip link\n1: lo: <LOOPBACK,UP,LOWER_UP> mtu 65536 qdisc noqueue state UNKNOWN mode DEFAULT group default qlen 1000\n    link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00\n2: enp0s3: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc fq_codel state UP mode DEFAULT group default qlen 1000\n    link/ether 08:00:27:dd:d7:43 brd ff:ff:ff:ff:ff:ff\n3: enp0s8: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc fq_codel state UP mode DEFAULT group default qlen 1000\n    link/ether 08:00:27:b0:d6:ff brd ff:ff:ff:ff:ff:ff\n4: enp0s9: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc fq_codel state UP mode DEFAULT group default qlen 1000\n    link/ether 08:00:27:e6:4d:39 brd ff:ff:ff:ff:ff:ff\n5: enp0s10: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc fq_codel state UP mode DEFAULT group default qlen 1000\n    link/ether 08:00:27:8e:75:44 brd ff:ff:ff:ff:ff:ff\nFor example, to bind the network interface enp0s3 to the socket, write as follows.\nimport socket\nETH_P_ALL = 3\ninterface = 'enp0s3'\ns = socket.socket(socket.AF_PACKET, socket.SOCK_RAW, socket.htons(ETH_P_ALL))\ns.bind((interface, 0))\n# do something\ns.close()\nNow you are ready to send and receive raw data on the data link layer using the network interface enp0s3.\nReceive Data Using Raw Sockets\nUse recv() to receive data using a socket. Specify the buffer size in first argument of recv(). recv() will block until ready to receive data from the socket. The return value of recv() is the received byte sequence. This byte string consists of the header and the payload of the Ethernet frame.\nWhen receiving data sent to enp0s3, the script server.py is as follows:\nimport socket\nETH_P_ALL = 3\nETH_FRAME_LEN = 1514  # Max. octets in frame sans FCS\ninterface = 'enp0s3'\ns = socket.socket(socket.AF_PACKET, socket.SOCK_RAW, socket.htons(ETH_P_ALL))\ns.bind((interface, 0))\ndata = s.recv(ETH_FRAME_LEN)\nprint(data)           # => b'\\x08\\x00\\x27\\xdd\\xd7\\x43\\x08\\x00\\x27\\x8e\\x75\\x44\\x88\\xb5Hi'\ns.close()\nNote that the data link raw sockets require a root permission. Please run the above script as root.\nWhen the data is sent to enp0s3, you can get the following output:\n$ sudo python3 server.py\nb\"\\x08\\x00'\\xdd\\xd7C\\x08\\x00'\\x8euD\\x88\\xb5Hi\"\nSend Data Using Raw Sockets\nTo send data using a socket, use sendall(). The data to be sent must be a byte sequence containing the header and payload of the Ethernet frame.\nWhen sending data “Hi” from enp0s10 (08:00:27:8e:75:44) to enp0s3 (08:00:27:dd:d7:43), the script client.py is as follows:\nimport socket\nETH_P_ALL = 3\ninterface = 'enp0s10'\ndst = b'\\x08\\x00\\x27\\xdd\\xd7\\x43'  # destination MAC address\nsrc = b'\\x08\\x00\\x27\\x8e\\x75\\x44'  # source MAC address\nproto = b'\\x88\\xb5'                # ethernet frame type\npayload = 'Hi'.encode()            # payload\ns = socket.socket(socket.AF_PACKET, socket.SOCK_RAW, socket.htons(ETH_P_ALL))\ns.bind((interface, 0))\ns.sendall(dst + src + proto + payload)\ns.close()\nThen,\n$ sudo python3 client.py\nSent!\nMake sure that the server side terminal outputs the data you sent.\nsocket — Low-level networking interface\nSource code: Lib/socket.py\n\nThis module provides access to the BSD socket interface. It is available on all modern Unix systems, Windows, MacOS, and probably additional platforms.\nNote\n \nSome behavior may be platform dependent, since calls are made to the operating system socket APIs.\nAvailability: not WASI.\nThis module does not work or is not available on WebAssembly. See WebAssembly platforms for more information.\nThe Python interface is a straightforward transliteration of the Unix system call and library interface for sockets to Python’s object-oriented style: the socket() function returns a socket object whose methods implement the various socket system calls. Parameter types are somewhat higher-level than in the C interface: as with read() and write() operations on Python files, buffer allocation on receive operations is automatic, and buffer length is implicit on send operations.\nSee also\nModule socketserver\nClasses that simplify writing network servers.\nModule ssl\nA TLS/SSL wrapper for socket objects.\nSocket families\nDepending on the system and the build options, various socket families are supported by this module.\nThe address format required by a particular socket object is automatically selected based on the address family specified when the socket object was created. Socket addresses are represented as follows:\nThe address of an AF_UNIX socket bound to a file system node is represented as a string, using the file system encoding and the 'surrogateescape' error handler (see PEP 383). An address in Linux’s abstract namespace is returned as a bytes-like object with an initial null byte; note that sockets in this namespace can communicate with normal file system sockets, so programs intended to run on Linux may need to deal with both types of address. A string or bytes-like object can be used for either type of address when passing it as an argument.\nChanged in version 3.3: Previously, AF_UNIX socket paths were assumed to use UTF-8 encoding.\nChanged in version 3.5: Writable bytes-like object is now accepted.\nA pair (host, port) is used for the AF_INET address family, where host is a string representing either a hostname in internet domain notation like 'daring.cwi.nl' or an IPv4 address like '100.50.200.5', and port is an integer.\nFor IPv4 addresses, two special forms are accepted instead of a host address: '' represents INADDR_ANY, which is used to bind to all interfaces, and the string '<broadcast>' represents INADDR_BROADCAST. This behavior is not compatible with IPv6, therefore, you may want to avoid these if you intend to support IPv6 with your Python programs.\nFor AF_INET6 address family, a four-tuple (host, port, flowinfo, scope_id) is used, where flowinfo and scope_id represent the sin6_flowinfo and sin6_scope_id members in struct sockaddr_in6 in C. For socket module methods, flowinfo and scope_id can be omitted just for backward compatibility. Note, however, omission of scope_id can cause problems in manipulating scoped IPv6 addresses.\nChanged in version 3.7: For multicast addresses (with scope_id meaningful) address may not contain %scope_id (or zone id) part. This information is superfluous and may be safely omitted (recommended).\nAF_NETLINK sockets are represented as pairs (pid, groups).\nLinux-only support for TIPC is available using the AF_TIPC address family. TIPC is an open, non-IP based networked protocol designed for use in clustered computer environments. Addresses are represented by a tuple, and the fields depend on the address type. The general tuple form is (addr_type, v1, v2, v3 [, scope]), where:\naddr_type is one of TIPC_ADDR_NAMESEQ, TIPC_ADDR_NAME, or TIPC_ADDR_ID.\nscope is one of TIPC_ZONE_SCOPE, TIPC_CLUSTER_SCOPE, and TIPC_NODE_SCOPE.\nIf addr_type is TIPC_ADDR_NAME, then v1 is the server type, v2 is the port identifier, and v3 should be 0.\nIf addr_type is TIPC_ADDR_NAMESEQ, then v1 is the server type, v2 is the lower port number, and v3 is the upper port number.\nIf addr_type is TIPC_ADDR_ID, then v1 is the node, v2 is the reference, and v3 should be set to 0.\nA tuple (interface, ) is used for the AF_CAN address family, where interface is a string representing a network interface name like 'can0'. The network interface name '' can be used to receive packets from all network interfaces of this family.\nCAN_ISOTP protocol require a tuple (interface, rx_addr, tx_addr) where both additional parameters are unsigned long integer that represent a CAN identifier (standard or extended).\nCAN_J1939 protocol require a tuple (interface, name, pgn, addr) where additional parameters are 64-bit unsigned integer representing the ECU name, a 32-bit unsigned integer representing the Parameter Group Number (PGN), and an 8-bit integer representing the address.\nA string or a tuple (id, unit) is used for the SYSPROTO_CONTROL protocol of the PF_SYSTEM family. The string is the name of a kernel control using a dynamically assigned ID. The tuple can be used if ID and unit number of the kernel control are known or if a registered ID is used.\nAdded in version 3.3.\nAF_BLUETOOTH supports the following protocols and address formats:\nBTPROTO_L2CAP accepts (bdaddr, psm) where bdaddr is the Bluetooth address as a string and psm is an integer.\nBTPROTO_RFCOMM accepts (bdaddr, channel) where bdaddr is the Bluetooth address as a string and channel is an integer.\nBTPROTO_HCI accepts a format that depends on your OS.\nOn Linux it accepts a tuple (device_id,) where device_id is an integer specifying the number of the Bluetooth device.\nOn FreeBSD, NetBSD and DragonFly BSD it accepts bdaddr where bdaddr is the Bluetooth address as a string.\nChanged in version 3.2: NetBSD and DragonFlyBSD support added.\nChanged in version 3.13.3: FreeBSD support added.\nBTPROTO_SCO accepts bdaddr where bdaddr is the Bluetooth address as a string or a bytes object. (ex. '12:23:34:45:56:67' or b'12:23:34:45:56:67') This protocol is not supported under FreeBSD.\nAF_ALG is a Linux-only socket based interface to Kernel cryptography. An algorithm socket is configured with a tuple of two to four elements (type, name [, feat [, mask]]), where:\ntype is the algorithm type as string, e.g. aead, hash, skcipher or rng.\nname is the algorithm name and operation mode as string, e.g. sha256, hmac(sha256), cbc(aes) or drbg_nopr_ctr_aes256.\nfeat and mask are unsigned 32bit integers.\nAvailability: Linux >= 2.6.38.\nSome algorithm types require more recent Kernels.\nAdded in version 3.6.\nAF_VSOCK allows communication between virtual machines and their hosts. The sockets are represented as a (CID, port) tuple where the context ID or CID and port are integers.\nAvailability: Linux >= 3.9\nSee vsock(7)\nAdded in version 3.7.\nAF_PACKET is a low-level interface directly to network devices. The addresses are represented by the tuple (ifname, proto[, pkttype[, hatype[, addr]]]) where:\nifname - String specifying the device name.\nproto - The Ethernet protocol number. May be ETH_P_ALL to capture all protocols, one of the ETHERTYPE_* constants or any other Ethernet protocol number.\npkttype - Optional integer specifying the packet type:\nPACKET_HOST (the default) - Packet addressed to the local host.\nPACKET_BROADCAST - Physical-layer broadcast packet.\nPACKET_MULTICAST - Packet sent to a physical-layer multicast address.\nPACKET_OTHERHOST - Packet to some other host that has been caught by a device driver in promiscuous mode.\nPACKET_OUTGOING - Packet originating from the local host that is looped back to a packet socket.\nhatype - Optional integer specifying the ARP hardware address type.\naddr - Optional bytes-like object specifying the hardware physical address, whose interpretation depends on the device.\nAvailability: Linux >= 2.2.\nAF_QIPCRTR is a Linux-only socket based interface for communicating with services running on co-processors in Qualcomm platforms. The address family is represented as a (node, port) tuple where the node and port are non-negative integers.\nAvailability: Linux >= 4.7.\nAdded in version 3.8.\nIPPROTO_UDPLITE is a variant of UDP which allows you to specify what portion of a packet is covered with the checksum. It adds two socket options that you can change. self.setsockopt(IPPROTO_UDPLITE, UDPLITE_SEND_CSCOV, length) will change what portion of outgoing packets are covered by the checksum and self.setsockopt(IPPROTO_UDPLITE, UDPLITE_RECV_CSCOV, length) will filter out packets which cover too little of their data. In both cases length should be in range(8, 2**16, 8).\nSuch a socket should be constructed with socket(AF_INET, SOCK_DGRAM, IPPROTO_UDPLITE) for IPv4 or socket(AF_INET6, SOCK_DGRAM, IPPROTO_UDPLITE) for IPv6.\nAvailability: Linux >= 2.6.20, FreeBSD >= 10.1\nAdded in version 3.9.\nAF_HYPERV is a Windows-only socket based interface for communicating with Hyper-V hosts and guests. The address family is represented as a (vm_id, service_id) tuple where the vm_id and service_id are UUID strings.\nThe vm_id is the virtual machine identifier or a set of known VMID values if the target is not a specific virtual machine. Known VMID constants defined on socket are:\nHV_GUID_ZERO\nHV_GUID_BROADCAST\nHV_GUID_WILDCARD - Used to bind on itself and accept connections from all partitions.\nHV_GUID_CHILDREN - Used to bind on itself and accept connection from child partitions.\nHV_GUID_LOOPBACK - Used as a target to itself.\nHV_GUID_PARENT - When used as a bind accepts connection from the parent partition. When used as an address target it will connect to the parent partition.\nThe service_id is the service identifier of the registered service.\nAdded in version 3.12.\nIf you use a hostname in the host portion of IPv4/v6 socket address, the program may show a nondeterministic behavior, as Python uses the first address returned from the DNS resolution. The socket address will be resolved differently into an actual IPv4/v6 address, depending on the results from DNS resolution and/or the host configuration. For deterministic behavior use a numeric address in host portion.\nAll errors raise exceptions. The normal exceptions for invalid argument types and out-of-memory conditions can be raised. Errors related to socket or address semantics raise OSError or one of its subclasses.\nNon-blocking mode is supported through setblocking(). A generalization of this based on timeouts is supported through settimeout().\nModule contents\nThe module socket exports the following elements.\nExceptions\nexception socket.error\nA deprecated alias of OSError.\nChanged in version 3.3: Following PEP 3151, this class was made an alias of OSError.\nexception socket.herror\nA subclass of OSError, this exception is raised for address-related errors, i.e. for functions that use h_errno in the POSIX C API, including gethostbyname_ex() and gethostbyaddr(). The accompanying value is a pair (h_errno, string) representing an error returned by a library call. h_errno is a numeric value, while string represents the description of h_errno, as returned by the hstrerror() C function.\nChanged in version 3.3: This class was made a subclass of OSError.\nexception socket.gaierror\nA subclass of OSError, this exception is raised for address-related errors by getaddrinfo() and getnameinfo(). The accompanying value is a pair (error, string) representing an error returned by a library call. string represents the description of error, as returned by the gai_strerror() C function. The numeric error value will match one of the EAI_* constants defined in this module.\nChanged in version 3.3: This class was made a subclass of OSError.\nexception socket.timeout\nA deprecated alias of TimeoutError.\nA subclass of OSError, this exception is raised when a timeout occurs on a socket which has had timeouts enabled via a prior call to settimeout() (or implicitly through setdefaulttimeout()). The accompanying value is a string whose value is currently always “timed out”.\nChanged in version 3.3: This class was made a subclass of OSError.\nChanged in version 3.10: This class was made an alias of TimeoutError.\nConstants\nThe AF_* and SOCK_* constants are now AddressFamily and SocketKind IntEnum collections.\nAdded in version 3.4.\nsocket.AF_UNIX\nsocket.AF_INET\nsocket.AF_INET6\nThese constants represent the address (and protocol) families, used for the first argument to socket(). If the AF_UNIX constant is not defined then this protocol is unsupported. More constants may be available depending on the system.\nsocket.AF_UNSPEC\nAF_UNSPEC means that getaddrinfo() should return socket addresses for any address family (either IPv4, IPv6, or any other) that can be used.\nsocket.SOCK_STREAM\nsocket.SOCK_DGRAM\nsocket.SOCK_RAW\nsocket.SOCK_RDM\nsocket.SOCK_SEQPACKET\nThese constants represent the socket types, used for the second argument to socket(). More constants may be available depending on the system. (Only SOCK_STREAM and SOCK_DGRAM appear to be generally useful.)\nsocket.SOCK_CLOEXEC\nsocket.SOCK_NONBLOCK\nThese two constants, if defined, can be combined with the socket types and allow you to set some flags atomically (thus avoiding possible race conditions and the need for separate calls).\nSee also\n \nSecure File Descriptor Handling for a more thorough explanation.\nAvailability: Linux >= 2.6.27.\nAdded in version 3.2.\nSO_*\nsocket.SOMAXCONN\nMSG_*\nSOL_*\nSCM_*\nIPPROTO_*\nIPPORT_*\nINADDR_*\nIP_*\nIPV6_*\nEAI_*\nAI_*\nNI_*\nTCP_*\nMany constants of these forms, documented in the Unix documentation on sockets and/or the IP protocol, are also defined in the socket module. They are generally used in arguments to the setsockopt() and getsockopt() methods of socket objects. In most cases, only those symbols that are defined in the Unix header files are defined; for a few symbols, default values are provided.\nChanged in version 3.6: SO_DOMAIN, SO_PROTOCOL, SO_PEERSEC, SO_PASSSEC, TCP_USER_TIMEOUT, TCP_CONGESTION were added.\nChanged in version 3.6.5: On Windows, TCP_FASTOPEN, TCP_KEEPCNT appear if run-time Windows supports.\nChanged in version 3.7: TCP_NOTSENT_LOWAT was added.\nOn Windows, TCP_KEEPIDLE, TCP_KEEPINTVL appear if run-time Windows supports.\nChanged in version 3.10: IP_RECVTOS was added. Added TCP_KEEPALIVE. On MacOS this constant can be used in the same way that TCP_KEEPIDLE is used on Linux.\nChanged in version 3.11: Added TCP_CONNECTION_INFO. On MacOS this constant can be used in the same way that TCP_INFO is used on Linux and BSD.\nChanged in version 3.12: Added SO_RTABLE and SO_USER_COOKIE. On OpenBSD and FreeBSD respectively those constants can be used in the same way that SO_MARK is used on Linux. Also added missing TCP socket options from Linux: TCP_MD5SIG, TCP_THIN_LINEAR_TIMEOUTS, TCP_THIN_DUPACK, TCP_REPAIR, TCP_REPAIR_QUEUE, TCP_QUEUE_SEQ, TCP_REPAIR_OPTIONS, TCP_TIMESTAMP, TCP_CC_INFO, TCP_SAVE_SYN, TCP_SAVED_SYN, TCP_REPAIR_WINDOW, TCP_FASTOPEN_CONNECT, TCP_ULP, TCP_MD5SIG_EXT, TCP_FASTOPEN_KEY, TCP_FASTOPEN_NO_COOKIE, TCP_ZEROCOPY_RECEIVE, TCP_INQ, TCP_TX_DELAY. Added IP_PKTINFO, IP_UNBLOCK_SOURCE, IP_BLOCK_SOURCE, IP_ADD_SOURCE_MEMBERSHIP, IP_DROP_SOURCE_MEMBERSHIP.\nChanged in version 3.13: Added SO_BINDTOIFINDEX. On Linux this constant can be used in the same way that SO_BINDTODEVICE is used, but with the index of a network interface instead of its name.\nsocket.AF_CAN\nsocket.PF_CAN\nSOL_CAN_*\nCAN_*\nMany constants of these forms, documented in the Linux documentation, are also defined in the socket module.\nAvailability: Linux >= 2.6.25, NetBSD >= 8.\nAdded in version 3.3.\nChanged in version 3.11: NetBSD support was added.\nChanged in version 3.13.3 (unreleased): Restored missing CAN_RAW_ERR_FILTER on Linux.\nsocket.CAN_BCM\nCAN_BCM_*\nCAN_BCM, in the CAN protocol family, is the broadcast manager (BCM) protocol. Broadcast manager constants, documented in the Linux documentation, are also defined in the socket module.\nAvailability: Linux >= 2.6.25.\nNote\n \nThe CAN_BCM_CAN_FD_FRAME flag is only available on Linux >= 4.8.\nAdded in version 3.4.\nsocket.CAN_RAW_FD_FRAMES\nEnables CAN FD support in a CAN_RAW socket. This is disabled by default. This allows your application to send both CAN and CAN FD frames; however, you must accept both CAN and CAN FD frames when reading from the socket.\nThis constant is documented in the Linux documentation.\nAvailability: Linux >= 3.6.\nAdded in version 3.5.\nsocket.CAN_RAW_JOIN_FILTERS\nJoins the applied CAN filters such that only CAN frames that match all given CAN filters are passed to user space.\nThis constant is documented in the Linux documentation.\nAvailability: Linux >= 4.1.\nAdded in version 3.9.\nsocket.CAN_ISOTP\nCAN_ISOTP, in the CAN protocol family, is the ISO-TP (ISO 15765-2) protocol. ISO-TP constants, documented in the Linux documentation.\nAvailability: Linux >= 2.6.25.\nAdded in version 3.7.\nsocket.CAN_J1939\nCAN_J1939, in the CAN protocol family, is the SAE J1939 protocol. J1939 constants, documented in the Linux documentation.\nAvailability: Linux >= 5.4.\nAdded in version 3.9.\nsocket.AF_DIVERT\nsocket.PF_DIVERT\nThese two constants, documented in the FreeBSD divert(4) manual page, are also defined in the socket module.\nAvailability: FreeBSD >= 14.0.\nAdded in version 3.12.\nsocket.AF_PACKET\nsocket.PF_PACKET\nPACKET_*\nMany constants of these forms, documented in the Linux documentation, are also defined in the socket module.\nAvailability: Linux >= 2.2.\nsocket.ETH_P_ALL\nETH_P_ALL can be used in the socket constructor as proto for the AF_PACKET family in order to capture every packet, regardless of protocol.\nFor more information, see the packet(7) manpage.\nAvailability: Linux.\nAdded in version 3.12.\nsocket.AF_RDS\nsocket.PF_RDS\nsocket.SOL_RDS\nRDS_*\nMany constants of these forms, documented in the Linux documentation, are also defined in the socket module.\nAvailability: Linux >= 2.6.30.\nAdded in version 3.3.\nsocket.SIO_RCVALL\nsocket.SIO_KEEPALIVE_VALS\nsocket.SIO_LOOPBACK_FAST_PATH\nRCVALL_*\nConstants for Windows’ WSAIoctl(). The constants are used as arguments to the ioctl() method of socket objects.\nChanged in version 3.6: SIO_LOOPBACK_FAST_PATH was added.\nTIPC_*\nTIPC related constants, matching the ones exported by the C socket API. See the TIPC documentation for more information.\nsocket.AF_ALG\nsocket.SOL_ALG\nALG_*\nConstants for Linux Kernel cryptography.\nAvailability: Linux >= 2.6.38.\nAdded in version 3.6.\nsocket.AF_VSOCK\nsocket.IOCTL_VM_SOCKETS_GET_LOCAL_CID\nVMADDR*\nSO_VM*\nConstants for Linux host/guest communication.\nAvailability: Linux >= 4.8.\nAdded in version 3.7.\nsocket.AF_LINK\nAvailability: BSD, macOS.\nAdded in version 3.4.\nsocket.has_ipv6\nThis constant contains a boolean value which indicates if IPv6 is supported on this platform.\nsocket.BDADDR_ANY\nsocket.BDADDR_LOCAL\nThese are string constants containing Bluetooth addresses with special meanings. For example, BDADDR_ANY can be used to indicate any address when specifying the binding socket with BTPROTO_RFCOMM.\nsocket.HCI_FILTER\nsocket.HCI_TIME_STAMP\nsocket.HCI_DATA_DIR\nFor use with BTPROTO_HCI. HCI_FILTER is only available on Linux and FreeBSD. HCI_TIME_STAMP and HCI_DATA_DIR are only available on Linux.\nsocket.AF_QIPCRTR\nConstant for Qualcomm’s IPC router protocol, used to communicate with service providing remote processors.\nAvailability: Linux >= 4.7.\nsocket.SCM_CREDS2\nsocket.LOCAL_CREDS\nsocket.LOCAL_CREDS_PERSISTENT\nLOCAL_CREDS and LOCAL_CREDS_PERSISTENT can be used with SOCK_DGRAM, SOCK_STREAM sockets, equivalent to Linux/DragonFlyBSD SO_PASSCRED, while LOCAL_CREDS sends the credentials at first read, LOCAL_CREDS_PERSISTENT sends for each read, SCM_CREDS2 must be then used for the latter for the message type.\nAdded in version 3.11.\nAvailability: FreeBSD.\nsocket.SO_INCOMING_CPU\nConstant to optimize CPU locality, to be used in conjunction with SO_REUSEPORT.\nAdded in version 3.11.\nAvailability: Linux >= 3.9\nsocket.AF_HYPERV\nsocket.HV_PROTOCOL_RAW\nsocket.HVSOCKET_CONNECT_TIMEOUT\nsocket.HVSOCKET_CONNECT_TIMEOUT_MAX\nsocket.HVSOCKET_CONNECTED_SUSPEND\nsocket.HVSOCKET_ADDRESS_FLAG_PASSTHRU\nsocket.HV_GUID_ZERO\nsocket.HV_GUID_WILDCARD\nsocket.HV_GUID_BROADCAST\nsocket.HV_GUID_CHILDREN\nsocket.HV_GUID_LOOPBACK\nsocket.HV_GUID_PARENT\nConstants for Windows Hyper-V sockets for host/guest communications.\nAvailability: Windows.\nAdded in version 3.12.\nsocket.ETHERTYPE_ARP\nsocket.ETHERTYPE_IP\nsocket.ETHERTYPE_IPV6\nsocket.ETHERTYPE_VLAN\nIEEE 802.3 protocol number. constants.\nAvailability: Linux, FreeBSD, macOS.\nAdded in version 3.12.\nsocket.SHUT_RD\nsocket.SHUT_WR\nsocket.SHUT_RDWR\nThese constants are used by the shutdown() method of socket objects.\nAvailability: not WASI.\nFunctions\nCreating sockets\nThe following functions all create socket objects.\nclass socket.socket(family=AF_INET, type=SOCK_STREAM, proto=0, fileno=None)\nCreate a new socket using the given address family, socket type and protocol number. The address family should be AF_INET (the default), AF_INET6, AF_UNIX, AF_CAN, AF_PACKET, or AF_RDS. The socket type should be SOCK_STREAM (the default), SOCK_DGRAM, SOCK_RAW or perhaps one of the other SOCK_ constants. The protocol number is usually zero and may be omitted or in the case where the address family is AF_CAN the protocol should be one of CAN_RAW, CAN_BCM, CAN_ISOTP or CAN_J1939.\nIf fileno is specified, the values for family, type, and proto are auto-detected from the specified file descriptor. Auto-detection can be overruled by calling the function with explicit family, type, or proto arguments. This only affects how Python represents e.g. the return value of socket.getpeername() but not the actual OS resource. Unlike socket.fromfd(), fileno will return the same socket and not a duplicate. This may help close a detached socket using socket.close().\nThe newly created socket is non-inheritable.\nRaises an auditing event socket.__new__ with arguments self, family, type, protocol.\nChanged in version 3.3: The AF_CAN family was added. The AF_RDS family was added.\nChanged in version 3.4: The CAN_BCM protocol was added.\nChanged in version 3.4: The returned socket is now non-inheritable.\nChanged in version 3.7: The CAN_ISOTP protocol was added.\nChanged in version 3.7: When SOCK_NONBLOCK or SOCK_CLOEXEC bit flags are applied to type they are cleared, and socket.type will not reflect them. They are still passed to the underlying system socket() call. Therefore,\nCopy\nsock = socket.socket(\n    socket.AF_INET,\n    socket.SOCK_STREAM | socket.SOCK_NONBLOCK)\nwill still create a non-blocking socket on OSes that support SOCK_NONBLOCK, but sock.type will be set to socket.SOCK_STREAM.\nChanged in version 3.9: The CAN_J1939 protocol was added.\nChanged in version 3.10: The IPPROTO_MPTCP protocol was added.\nsocket.socketpair([family[, type[, proto]]])\nBuild a pair of connected socket objects using the given address family, socket type, and protocol number. Address family, socket type, and protocol number are as for the socket() function above. The default family is AF_UNIX if defined on the platform; otherwise, the default is AF_INET.\nThe newly created sockets are non-inheritable.\nChanged in version 3.2: The returned socket objects now support the whole socket API, rather than a subset.\nChanged in version 3.4: The returned sockets are now non-inheritable.\nChanged in version 3.5: Windows support added.\nsocket.create_connection(address, timeout=GLOBAL_DEFAULT, source_address=None, *, all_errors=False)\nConnect to a TCP service listening on the internet address (a 2-tuple (host, port)), and return the socket object. This is a higher-level function than socket.connect(): if host is a non-numeric hostname, it will try to resolve it for both AF_INET and AF_INET6, and then try to connect to all possible addresses in turn until a connection succeeds. This makes it easy to write clients that are compatible to both IPv4 and IPv6.\nPassing the optional timeout parameter will set the timeout on the socket instance before attempting to connect. If no timeout is supplied, the global default timeout setting returned by getdefaulttimeout() is used.\nIf supplied, source_address must be a 2-tuple (host, port) for the socket to bind to as its source address before connecting. If host or port are ‘’ or 0 respectively the OS default behavior will be used.\nWhen a connection cannot be created, an exception is raised. By default, it is the exception from the last address in the list. If all_errors is True, it is an ExceptionGroup containing the errors of all attempts.\nChanged in version 3.2: source_address was added.\nChanged in version 3.11: all_errors was added.\nsocket.create_server(address, *, family=AF_INET, backlog=None, reuse_port=False, dualstack_ipv6=False)\nConvenience function which creates a TCP socket bound to address (a 2-tuple (host, port)) and returns the socket object.\nfamily should be either AF_INET or AF_INET6. backlog is the queue size passed to socket.listen(); if not specified , a default reasonable value is chosen. reuse_port dictates whether to set the SO_REUSEPORT socket option.\nIf dualstack_ipv6 is true, family is AF_INET6 and the platform supports it the socket will be able to accept both IPv4 and IPv6 connections, else it will raise ValueError. Most POSIX platforms and Windows are supposed to support this functionality. When this functionality is enabled the address returned by socket.getpeername() when an IPv4 connection occurs will be an IPv6 address represented as an IPv4-mapped IPv6 address. If dualstack_ipv6 is false it will explicitly disable this functionality on platforms that enable it by default (e.g. Linux). This parameter can be used in conjunction with has_dualstack_ipv6():\nCopy\nimport socket\n\naddr = (\"\", 8080)  # all interfaces, port 8080\nif socket.has_dualstack_ipv6():\n    s = socket.create_server(addr, family=socket.AF_INET6, dualstack_ipv6=True)\nelse:\n    s = socket.create_server(addr)\nNote\n \nOn POSIX platforms the SO_REUSEADDR socket option is set in order to immediately reuse previous sockets which were bound on the same address and remained in TIME_WAIT state.\nAdded in version 3.8.\nsocket.has_dualstack_ipv6()\nReturn True if the platform supports creating a TCP socket which can handle both IPv4 and IPv6 connections.\nAdded in version 3.8.\nsocket.fromfd(fd, family, type, proto=0)\nDuplicate the file descriptor fd (an integer as returned by a file object’s fileno() method) and build a socket object from the result. Address family, socket type and protocol number are as for the socket() function above. The file descriptor should refer to a socket, but this is not checked — subsequent operations on the object may fail if the file descriptor is invalid. This function is rarely needed, but can be used to get or set socket options on a socket passed to a program as standard input or output (such as a server started by the Unix inet daemon). The socket is assumed to be in blocking mode.\nThe newly created socket is non-inheritable.\nChanged in version 3.4: The returned socket is now non-inheritable.\nsocket.fromshare(data)\nInstantiate a socket from data obtained from the socket.share() method. The socket is assumed to be in blocking mode.\nAvailability: Windows.\nAdded in version 3.3.\nsocket.SocketType\nThis is a Python type object that represents the socket object type. It is the same as type(socket(...)).\nOther functions\nThe socket module also offers various network-related services:\nsocket.close(fd)\nClose a socket file descriptor. This is like os.close(), but for sockets. On some platforms (most noticeable Windows) os.close() does not work for socket file descriptors.\nAdded in version 3.7.\nsocket.getaddrinfo(host, port, family=AF_UNSPEC, type=0, proto=0, flags=0)\nThis function wraps the C function getaddrinfo of the underlying system.\nTranslate the host/port argument into a sequence of 5-tuples that contain all the necessary arguments for creating a socket connected to that service. host is a domain name, a string representation of an IPv4/v6 address or None. port is a string service name such as 'http', a numeric port number or None. By passing None as the value of host and port, you can pass NULL to the underlying C API.\nThe family, type and proto arguments can be optionally specified in order to provide options and limit the list of addresses returned. Pass their default values (AF_UNSPEC, 0, and 0, respectively) to not limit the results. See the note below for details.\nThe flags argument can be one or several of the AI_* constants, and will influence how results are computed and returned. For example, AI_NUMERICHOST will disable domain name resolution and will raise an error if host is a domain name.\nThe function returns a list of 5-tuples with the following structure:\n(family, type, proto, canonname, sockaddr)\nIn these tuples, family, type, proto are all integers and are meant to be passed to the socket() function. canonname will be a string representing the canonical name of the host if AI_CANONNAME is part of the flags argument; else canonname will be empty. sockaddr is a tuple describing a socket address, whose format depends on the returned family (a (address, port) 2-tuple for AF_INET, a (address, port, flowinfo, scope_id) 4-tuple for AF_INET6), and is meant to be passed to the socket.connect() method.\nNote\n \nIf you intend to use results from getaddrinfo() to create a socket (rather than, for example, retrieve canonname), consider limiting the results by type (e.g. SOCK_STREAM or SOCK_DGRAM) and/or proto (e.g. IPPROTO_TCP or IPPROTO_UDP) that your application can handle.\nThe behavior with default values of family, type, proto and flags is system-specific.\nMany systems (for example, most Linux configurations) will return a sorted list of all matching addresses. These addresses should generally be tried in order until a connection succeeds (possibly tried in parallel, for example, using a Happy Eyeballs algorithm). In these cases, limiting the type and/or proto can help eliminate unsuccessful or unusable connection attempts.\nSome systems will, however, only return a single address. (For example, this was reported on Solaris and AIX configurations.) On these systems, limiting the type and/or proto helps ensure that this address is usable.\nRaises an auditing event socket.getaddrinfo with arguments host, port, family, type, protocol.\nThe following example fetches address information for a hypothetical TCP connection to example.org on port 80 (results may differ on your system if IPv6 isn’t enabled):\nCopy\n>>> socket.getaddrinfo(\"example.org\", 80, proto=socket.IPPROTO_TCP)\n[(socket.AF_INET6, socket.SOCK_STREAM,\n 6, '', ('2606:2800:220:1:248:1893:25c8:1946', 80, 0, 0)),\n (socket.AF_INET, socket.SOCK_STREAM,\n 6, '', ('93.184.216.34', 80))]\nChanged in version 3.2: parameters can now be passed using keyword arguments.\nChanged in version 3.7: for IPv6 multicast addresses, string representing an address will not contain %scope_id part.\nsocket.getfqdn([name])\nReturn a fully qualified domain name for name. If name is omitted or empty, it is interpreted as the local host. To find the fully qualified name, the hostname returned by gethostbyaddr() is checked, followed by aliases for the host, if available. The first name which includes a period is selected. In case no fully qualified domain name is available and name was provided, it is returned unchanged. If name was empty or equal to '0.0.0.0', the hostname from gethostname() is returned.\nsocket.gethostbyname(hostname)\nTranslate a host name to IPv4 address format. The IPv4 address is returned as a string, such as '100.50.200.5'. If the host name is an IPv4 address itself it is returned unchanged. See gethostbyname_ex() for a more complete interface. gethostbyname() does not support IPv6 name resolution, and getaddrinfo() should be used instead for IPv4/v6 dual stack support.\nRaises an auditing event socket.gethostbyname with argument hostname.\nAvailability: not WASI.\nsocket.gethostbyname_ex(hostname)\nTranslate a host name to IPv4 address format, extended interface. Return a 3-tuple (hostname, aliaslist, ipaddrlist) where hostname is the host’s primary host name, aliaslist is a (possibly empty) list of alternative host names for the same address, and ipaddrlist is a list of IPv4 addresses for the same interface on the same host (often but not always a single address). gethostbyname_ex() does not support IPv6 name resolution, and getaddrinfo() should be used instead for IPv4/v6 dual stack support.\nRaises an auditing event socket.gethostbyname with argument hostname.\nAvailability: not WASI.\nsocket.gethostname()\nReturn a string containing the hostname of the machine where the Python interpreter is currently executing.\nRaises an auditing event socket.gethostname with no arguments.\nNote: gethostname() doesn’t always return the fully qualified domain name; use getfqdn() for that.\nAvailability: not WASI.\nsocket.gethostbyaddr(ip_address)\nReturn a 3-tuple (hostname, aliaslist, ipaddrlist) where hostname is the primary host name responding to the given ip_address, aliaslist is a (possibly empty) list of alternative host names for the same address, and ipaddrlist is a list of IPv4/v6 addresses for the same interface on the same host (most likely containing only a single address). To find the fully qualified domain name, use the function getfqdn(). gethostbyaddr() supports both IPv4 and IPv6.\nRaises an auditing event socket.gethostbyaddr with argument ip_address.\nAvailability: not WASI.\nsocket.getnameinfo(sockaddr, flags)\nTranslate a socket address sockaddr into a 2-tuple (host, port). Depending on the settings of flags, the result can contain a fully qualified domain name or numeric address representation in host. Similarly, port can contain a string port name or a numeric port number.\nFor IPv6 addresses, %scope_id is appended to the host part if sockaddr contains meaningful scope_id. Usually this happens for multicast addresses.\nFor more information about flags you can consult getnameinfo(3).\nRaises an auditing event socket.getnameinfo with argument sockaddr.\nAvailability: not WASI.\nsocket.getprotobyname(protocolname)\nTranslate an internet protocol name (for example, 'icmp') to a constant suitable for passing as the (optional) third argument to the socket() function. This is usually only needed for sockets opened in “raw” mode (SOCK_RAW); for the normal socket modes, the correct protocol is chosen automatically if the protocol is omitted or zero.\nAvailability: not WASI.\nsocket.getservbyname(servicename[, protocolname])\nTranslate an internet service name and protocol name to a port number for that service. The optional protocol name, if given, should be 'tcp' or 'udp', otherwise any protocol will match.\nRaises an auditing event socket.getservbyname with arguments servicename, protocolname.\nAvailability: not WASI.\nsocket.getservbyport(port[, protocolname])\nTranslate an internet port number and protocol name to a service name for that service. The optional protocol name, if given, should be 'tcp' or 'udp', otherwise any protocol will match.\nRaises an auditing event socket.getservbyport with arguments port, protocolname.\nAvailability: not WASI.\nsocket.ntohl(x)\nConvert 32-bit positive integers from network to host byte order. On machines where the host byte order is the same as network byte order, this is a no-op; otherwise, it performs a 4-byte swap operation.\nsocket.ntohs(x)\nConvert 16-bit positive integers from network to host byte order. On machines where the host byte order is the same as network byte order, this is a no-op; otherwise, it performs a 2-byte swap operation.\nChanged in version 3.10: Raises OverflowError if x does not fit in a 16-bit unsigned integer.\nsocket.htonl(x)\nConvert 32-bit positive integers from host to network byte order. On machines where the host byte order is the same as network byte order, this is a no-op; otherwise, it performs a 4-byte swap operation.\nsocket.htons(x)\nConvert 16-bit positive integers from host to network byte order. On machines where the host byte order is the same as network byte order, this is a no-op; otherwise, it performs a 2-byte swap operation.\nChanged in version 3.10: Raises OverflowError if x does not fit in a 16-bit unsigned integer.\nsocket.inet_aton(ip_string)\nConvert an IPv4 address from dotted-quad string format (for example, ‘123.45.67.89’) to 32-bit packed binary format, as a bytes object four characters in length. This is useful when conversing with a program that uses the standard C library and needs objects of type in_addr, which is the C type for the 32-bit packed binary this function returns.\ninet_aton() also accepts strings with less than three dots; see the Unix manual page inet(3) for details.\nIf the IPv4 address string passed to this function is invalid, OSError will be raised. Note that exactly what is valid depends on the underlying C implementation of inet_aton().\ninet_aton() does not support IPv6, and inet_pton() should be used instead for IPv4/v6 dual stack support.\nsocket.inet_ntoa(packed_ip)\nConvert a 32-bit packed IPv4 address (a bytes-like object four bytes in length) to its standard dotted-quad string representation (for example, ‘123.45.67.89’). This is useful when conversing with a program that uses the standard C library and needs objects of type in_addr, which is the C type for the 32-bit packed binary data this function takes as an argument.\nIf the byte sequence passed to this function is not exactly 4 bytes in length, OSError will be raised. inet_ntoa() does not support IPv6, and inet_ntop() should be used instead for IPv4/v6 dual stack support.\nChanged in version 3.5: Writable bytes-like object is now accepted.\nsocket.inet_pton(address_family, ip_string)\nConvert an IP address from its family-specific string format to a packed, binary format. inet_pton() is useful when a library or network protocol calls for an object of type in_addr (similar to inet_aton()) or in6_addr.\nSupported values for address_family are currently AF_INET and AF_INET6. If the IP address string ip_string is invalid, OSError will be raised. Note that exactly what is valid depends on both the value of address_family and the underlying implementation of inet_pton().\nAvailability: Unix, Windows.\nChanged in version 3.4: Windows support added\nsocket.inet_ntop(address_family, packed_ip)\nConvert a packed IP address (a bytes-like object of some number of bytes) to its standard, family-specific string representation (for example, '7.10.0.5' or '5aef:2b::8'). inet_ntop() is useful when a library or network protocol returns an object of type in_addr (similar to inet_ntoa()) or in6_addr.\nSupported values for address_family are currently AF_INET and AF_INET6. If the bytes object packed_ip is not the correct length for the specified address family, ValueError will be raised. OSError is raised for errors from the call to inet_ntop().\nAvailability: Unix, Windows.\nChanged in version 3.4: Windows support added\nChanged in version 3.5: Writable bytes-like object is now accepted.\nsocket.CMSG_LEN(length)\nReturn the total length, without trailing padding, of an ancillary data item with associated data of the given length. This value can often be used as the buffer size for recvmsg() to receive a single item of ancillary data, but RFC 3542 requires portable applications to use CMSG_SPACE() and thus include space for padding, even when the item will be the last in the buffer. Raises OverflowError if length is outside the permissible range of values.\nAvailability: Unix, not WASI.\nMost Unix platforms.\nAdded in version 3.3.\nsocket.CMSG_SPACE(length)\nReturn the buffer size needed for recvmsg() to receive an ancillary data item with associated data of the given length, along with any trailing padding. The buffer space needed to receive multiple items is the sum of the CMSG_SPACE() values for their associated data lengths. Raises OverflowError if length is outside the permissible range of values.\nNote that some systems might support ancillary data without providing this function. Also note that setting the buffer size using the results of this function may not precisely limit the amount of ancillary data that can be received, since additional data may be able to fit into the padding area.\nAvailability: Unix, not WASI.\nmost Unix platforms.\nAdded in version 3.3.\nsocket.getdefaulttimeout()\nReturn the default timeout in seconds (float) for new socket objects. A value of None indicates that new socket objects have no timeout. When the socket module is first imported, the default is None.\nsocket.setdefaulttimeout(timeout)\nSet the default timeout in seconds (float) for new socket objects. When the socket module is first imported, the default is None. See settimeout() for possible values and their respective meanings.\nsocket.sethostname(name)\nSet the machine’s hostname to name. This will raise an OSError if you don’t have enough rights.\nRaises an auditing event socket.sethostname with argument name.\nAvailability: Unix, not Android.\nAdded in version 3.3.\nsocket.if_nameindex()\nReturn a list of network interface information (index int, name string) tuples. OSError if the system call fails.\nAvailability: Unix, Windows, not WASI.\nAdded in version 3.3.\nChanged in version 3.8: Windows support was added.\nNote\n \nOn Windows network interfaces have different names in different contexts (all names are examples):\nUUID: {FB605B73-AAC2-49A6-9A2F-25416AEA0573}\nname: ethernet_32770\nfriendly name: vEthernet (nat)\ndescription: Hyper-V Virtual Ethernet Adapter\nThis function returns names of the second form from the list, ethernet_32770 in this example case.\nsocket.if_nametoindex(if_name)\nReturn a network interface index number corresponding to an interface name. OSError if no interface with the given name exists.\nAvailability: Unix, Windows, not WASI.\nAdded in version 3.3.\nChanged in version 3.8: Windows support was added.\nSee also\n \n“Interface name” is a name as documented in if_nameindex().\nsocket.if_indextoname(if_index)\nReturn a network interface name corresponding to an interface index number. OSError if no interface with the given index exists.\nAvailability: Unix, Windows, not WASI.\nAdded in version 3.3.\nChanged in version 3.8: Windows support was added.\nSee also\n \n“Interface name” is a name as documented in if_nameindex().\nsocket.send_fds(sock, buffers, fds[, flags[, address]])\nSend the list of file descriptors fds over an AF_UNIX socket sock. The fds parameter is a sequence of file descriptors. Consult sendmsg() for the documentation of these parameters.\nAvailability: Unix, Windows, not WASI.\nUnix platforms supporting sendmsg() and SCM_RIGHTS mechanism.\nAdded in version 3.9.\nsocket.recv_fds(sock, bufsize, maxfds[, flags])\nReceive up to maxfds file descriptors from an AF_UNIX socket sock. Return (msg, list(fds), flags, addr). Consult recvmsg() for the documentation of these parameters.\nAvailability: Unix, Windows, not WASI.\nUnix platforms supporting sendmsg() and SCM_RIGHTS mechanism.\nAdded in version 3.9.\nNote\n \nAny truncated integers at the end of the list of file descriptors.\nSocket Objects\nSocket objects have the following methods. Except for makefile(), these correspond to Unix system calls applicable to sockets.\nChanged in version 3.2: Support for the context manager protocol was added. Exiting the context manager is equivalent to calling close().\nsocket.accept()\nAccept a connection. The socket must be bound to an address and listening for connections. The return value is a pair (conn, address) where conn is a new socket object usable to send and receive data on the connection, and address is the address bound to the socket on the other end of the connection.\nThe newly created socket is non-inheritable.\nChanged in version 3.4: The socket is now non-inheritable.\nChanged in version 3.5: If the system call is interrupted and the signal handler does not raise an exception, the method now retries the system call instead of raising an InterruptedError exception (see PEP 475 for the rationale).\nsocket.bind(address)\nBind the socket to address. The socket must not already be bound. (The format of address depends on the address family — see above.)\nRaises an auditing event socket.bind with arguments self, address.\nAvailability: not WASI.\nsocket.close()\nMark the socket closed. The underlying system resource (e.g. a file descriptor) is also closed when all file objects from makefile() are closed. Once that happens, all future operations on the socket object will fail. The remote end will receive no more data (after queued data is flushed).\nSockets are automatically closed when they are garbage-collected, but it is recommended to close() them explicitly, or to use a with statement around them.\nChanged in version 3.6: OSError is now raised if an error occurs when the underlying close() call is made.\nNote\n \nclose() releases the resource associated with a connection but does not necessarily close the connection immediately. If you want to close the connection in a timely fashion, call shutdown() before close().\nsocket.connect(address)\nConnect to a remote socket at address. (The format of address depends on the address family — see above.)\nIf the connection is interrupted by a signal, the method waits until the connection completes, or raise a TimeoutError on timeout, if the signal handler doesn’t raise an exception and the socket is blocking or has a timeout. For non-blocking sockets, the method raises an InterruptedError exception if the connection is interrupted by a signal (or the exception raised by the signal handler).\nRaises an auditing event socket.connect with arguments self, address.\nChanged in version 3.5: The method now waits until the connection completes instead of raising an InterruptedError exception if the connection is interrupted by a signal, the signal handler doesn’t raise an exception and the socket is blocking or has a timeout (see the PEP 475 for the rationale).\nAvailability: not WASI.\nsocket.connect_ex(address)\nLike connect(address), but return an error indicator instead of raising an exception for errors returned by the C-level connect() call (other problems, such as “host not found,” can still raise exceptions). The error indicator is 0 if the operation succeeded, otherwise the value of the errno variable. This is useful to support, for example, asynchronous connects.\nRaises an auditing event socket.connect with arguments self, address.\nAvailability: not WASI.\nsocket.detach()\nPut the socket object into closed state without actually closing the underlying file descriptor. The file descriptor is returned, and can be reused for other purposes.\nAdded in version 3.2.\nsocket.dup()\nDuplicate the socket.\nThe newly created socket is non-inheritable.\nChanged in version 3.4: The socket is now non-inheritable.\nAvailability: not WASI.\nsocket.fileno()\nReturn the socket’s file descriptor (a small integer), or -1 on failure. This is useful with select.select().\nUnder Windows the small integer returned by this method cannot be used where a file descriptor can be used (such as os.fdopen()). Unix does not have this limitation.\nsocket.get_inheritable()\nGet the inheritable flag of the socket’s file descriptor or socket’s handle: True if the socket can be inherited in child processes, False if it cannot.\nAdded in version 3.4.\nsocket.getpeername()\nReturn the remote address to which the socket is connected. This is useful to find out the port number of a remote IPv4/v6 socket, for instance. (The format of the address returned depends on the address family — see above.) On some systems this function is not supported.\nsocket.getsockname()\nReturn the socket’s own address. This is useful to find out the port number of an IPv4/v6 socket, for instance. (The format of the address returned depends on the address family — see above.)\nsocket.getsockopt(level, optname[, buflen])\nReturn the value of the given socket option (see the Unix man page getsockopt(2)). The needed symbolic constants (SO_* etc.) are defined in this module. If buflen is absent, an integer option is assumed and its integer value is returned by the function. If buflen is present, it specifies the maximum length of the buffer used to receive the option in, and this buffer is returned as a bytes object. It is up to the caller to decode the contents of the buffer (see the optional built-in module struct for a way to decode C structures encoded as byte strings).\nAvailability: not WASI.\nsocket.getblocking()\nReturn True if socket is in blocking mode, False if in non-blocking.\nThis is equivalent to checking socket.gettimeout() != 0.\nAdded in version 3.7.\nsocket.gettimeout()\nReturn the timeout in seconds (float) associated with socket operations, or None if no timeout is set. This reflects the last call to setblocking() or settimeout().\nsocket.ioctl(control, option)\nPlatform:\nWindows\nThe ioctl() method is a limited interface to the WSAIoctl system interface. Please refer to the Win32 documentation for more information.\nOn other platforms, the generic fcntl.fcntl() and fcntl.ioctl() functions may be used; they accept a socket object as their first argument.\nCurrently only the following control codes are supported: SIO_RCVALL, SIO_KEEPALIVE_VALS, and SIO_LOOPBACK_FAST_PATH.\nChanged in version 3.6: SIO_LOOPBACK_FAST_PATH was added.\nsocket.listen([backlog])\nEnable a server to accept connections. If backlog is specified, it must be at least 0 (if it is lower, it is set to 0); it specifies the number of unaccepted connections that the system will allow before refusing new connections. If not specified, a default reasonable value is chosen.\nAvailability: not WASI.\nChanged in version 3.5: The backlog parameter is now optional.\nsocket.makefile(mode='r', buffering=None, *, encoding=None, errors=None, newline=None)\nReturn a file object associated with the socket. The exact returned type depends on the arguments given to makefile(). These arguments are interpreted the same way as by the built-in open() function, except the only supported mode values are 'r' (default), 'w', 'b', or a combination of those.\nThe socket must be in blocking mode; it can have a timeout, but the file object’s internal buffer may end up in an inconsistent state if a timeout occurs.\nClosing the file object returned by makefile() won’t close the original socket unless all other file objects have been closed and socket.close() has been called on the socket object.\nNote\n \nOn Windows, the file-like object created by makefile() cannot be used where a file object with a file descriptor is expected, such as the stream arguments of subprocess.Popen().\nsocket.recv(bufsize[, flags])\nReceive data from the socket. The return value is a bytes object representing the data received. The maximum amount of data to be received at once is specified by bufsize. A returned empty bytes object indicates that the client has disconnected. See the Unix manual page recv(2) for the meaning of the optional argument flags; it defaults to zero.\nChanged in version 3.5: If the system call is interrupted and the signal handler does not raise an exception, the method now retries the system call instead of raising an InterruptedError exception (see PEP 475 for the rationale).\nsocket.recvfrom(bufsize[, flags])\nReceive data from the socket. The return value is a pair (bytes, address) where bytes is a bytes object representing the data received and address is the address of the socket sending the data. See the Unix manual page recv(2) for the meaning of the optional argument flags; it defaults to zero. (The format of address depends on the address family — see above.)\nChanged in version 3.5: If the system call is interrupted and the signal handler does not raise an exception, the method now retries the system call instead of raising an InterruptedError exception (see PEP 475 for the rationale).\nChanged in version 3.7: For multicast IPv6 address, first item of address does not contain %scope_id part anymore. In order to get full IPv6 address use getnameinfo().\nsocket.recvmsg(bufsize[, ancbufsize[, flags]])\nReceive normal data (up to bufsize bytes) and ancillary data from the socket. The ancbufsize argument sets the size in bytes of the internal buffer used to receive the ancillary data; it defaults to 0, meaning that no ancillary data will be received. Appropriate buffer sizes for ancillary data can be calculated using CMSG_SPACE() or CMSG_LEN(), and items which do not fit into the buffer might be truncated or discarded. The flags argument defaults to 0 and has the same meaning as for recv().\nThe return value is a 4-tuple: (data, ancdata, msg_flags, address). The data item is a bytes object holding the non-ancillary data received. The ancdata item is a list of zero or more tuples (cmsg_level, cmsg_type, cmsg_data) representing the ancillary data (control messages) received: cmsg_level and cmsg_type are integers specifying the protocol level and protocol-specific type respectively, and cmsg_data is a bytes object holding the associated data. The msg_flags item is the bitwise OR of various flags indicating conditions on the received message; see your system documentation for details. If the receiving socket is unconnected, address is the address of the sending socket, if available; otherwise, its value is unspecified.\nOn some systems, sendmsg() and recvmsg() can be used to pass file descriptors between processes over an AF_UNIX socket. When this facility is used (it is often restricted to SOCK_STREAM sockets), recvmsg() will return, in its ancillary data, items of the form (socket.SOL_SOCKET, socket.SCM_RIGHTS, fds), where fds is a bytes object representing the new file descriptors as a binary array of the native C int type. If recvmsg() raises an exception after the system call returns, it will first attempt to close any file descriptors received via this mechanism.\nSome systems do not indicate the truncated length of ancillary data items which have been only partially received. If an item appears to extend beyond the end of the buffer, recvmsg() will issue a RuntimeWarning, and will return the part of it which is inside the buffer provided it has not been truncated before the start of its associated data.\nOn systems which support the SCM_RIGHTS mechanism, the following function will receive up to maxfds file descriptors, returning the message data and a list containing the descriptors (while ignoring unexpected conditions such as unrelated control messages being received). See also sendmsg().\nCopy\nimport socket, array\n\ndef recv_fds(sock, msglen, maxfds):\n    fds = array.array(\"i\")   # Array of ints\n    msg, ancdata, flags, addr = sock.recvmsg(msglen, socket.CMSG_LEN(maxfds * fds.itemsize))\n    for cmsg_level, cmsg_type, cmsg_data in ancdata:\n        if cmsg_level == socket.SOL_SOCKET and cmsg_type == socket.SCM_RIGHTS:\n            # Append data, ignoring any truncated integers at the end.\n            fds.frombytes(cmsg_data[:len(cmsg_data) - (len(cmsg_data) % fds.itemsize)])\n    return msg, list(fds)\nAvailability: Unix.\nMost Unix platforms.\nAdded in version 3.3.\nChanged in version 3.5: If the system call is interrupted and the signal handler does not raise an exception, the method now retries the system call instead of raising an InterruptedError exception (see PEP 475 for the rationale).\nsocket.recvmsg_into(buffers[, ancbufsize[, flags]])\nReceive normal data and ancillary data from the socket, behaving as recvmsg() would, but scatter the non-ancillary data into a series of buffers instead of returning a new bytes object. The buffers argument must be an iterable of objects that export writable buffers (e.g. bytearray objects); these will be filled with successive chunks of the non-ancillary data until it has all been written or there are no more buffers. The operating system may set a limit (sysconf() value SC_IOV_MAX) on the number of buffers that can be used. The ancbufsize and flags arguments have the same meaning as for recvmsg().\nThe return value is a 4-tuple: (nbytes, ancdata, msg_flags, address), where nbytes is the total number of bytes of non-ancillary data written into the buffers, and ancdata, msg_flags and address are the same as for recvmsg().\nExample:\nCopy\n>>> import socket\n>>> s1, s2 = socket.socketpair()\n>>> b1 = bytearray(b'----')\n>>> b2 = bytearray(b'0123456789')\n>>> b3 = bytearray(b'--------------')\n>>> s1.send(b'Mary had a little lamb')\n22\n>>> s2.recvmsg_into([b1, memoryview(b2)[2:9], b3])\n(22, [], 0, None)\n>>> [b1, b2, b3]\n[bytearray(b'Mary'), bytearray(b'01 had a 9'), bytearray(b'little lamb---')]\nAvailability: Unix.\nMost Unix platforms.\nAdded in version 3.3.\nsocket.recvfrom_into(buffer[, nbytes[, flags]])\nReceive data from the socket, writing it into buffer instead of creating a new bytestring. The return value is a pair (nbytes, address) where nbytes is the number of bytes received and address is the address of the socket sending the data. See the Unix manual page recv(2) for the meaning of the optional argument flags; it defaults to zero. (The format of address depends on the address family — see above.)\nsocket.recv_into(buffer[, nbytes[, flags]])\nReceive up to nbytes bytes from the socket, storing the data into a buffer rather than creating a new bytestring. If nbytes is not specified (or 0), receive up to the size available in the given buffer. Returns the number of bytes received. See the Unix manual page recv(2) for the meaning of the optional argument flags; it defaults to zero.\nsocket.send(bytes[, flags])\nSend data to the socket. The socket must be connected to a remote socket. The optional flags argument has the same meaning as for recv() above. Returns the number of bytes sent. Applications are responsible for checking that all data has been sent; if only some of the data was transmitted, the application needs to attempt delivery of the remaining data. For further information on this topic, consult the Socket Programming HOWTO.\nChanged in version 3.5: If the system call is interrupted and the signal handler does not raise an exception, the method now retries the system call instead of raising an InterruptedError exception (see PEP 475 for the rationale).\nsocket.sendall(bytes[, flags])\nSend data to the socket. The socket must be connected to a remote socket. The optional flags argument has the same meaning as for recv() above. Unlike send(), this method continues to send data from bytes until either all data has been sent or an error occurs. None is returned on success. On error, an exception is raised, and there is no way to determine how much data, if any, was successfully sent.\nChanged in version 3.5: The socket timeout is no longer reset each time data is sent successfully. The socket timeout is now the maximum total duration to send all data.\nChanged in version 3.5: If the system call is interrupted and the signal handler does not raise an exception, the method now retries the system call instead of raising an InterruptedError exception (see PEP 475 for the rationale).\nsocket.sendto(bytes, address)\nsocket.sendto(bytes, flags, address)\nSend data to the socket. The socket should not be connected to a remote socket, since the destination socket is specified by address. The optional flags argument has the same meaning as for recv() above. Return the number of bytes sent. (The format of address depends on the address family — see above.)\nRaises an auditing event socket.sendto with arguments self, address.\nChanged in version 3.5: If the system call is interrupted and the signal handler does not raise an exception, the method now retries the system call instead of raising an InterruptedError exception (see PEP 475 for the rationale).\nsocket.sendmsg(buffers[, ancdata[, flags[, address]]])\nSend normal and ancillary data to the socket, gathering the non-ancillary data from a series of buffers and concatenating it into a single message. The buffers argument specifies the non-ancillary data as an iterable of bytes-like objects (e.g. bytes objects); the operating system may set a limit (sysconf() value SC_IOV_MAX) on the number of buffers that can be used. The ancdata argument specifies the ancillary data (control messages) as an iterable of zero or more tuples (cmsg_level, cmsg_type, cmsg_data), where cmsg_level and cmsg_type are integers specifying the protocol level and protocol-specific type respectively, and cmsg_data is a bytes-like object holding the associated data. Note that some systems (in particular, systems without CMSG_SPACE()) might support sending only one control message per call. The flags argument defaults to 0 and has the same meaning as for send(). If address is supplied and not None, it sets a destination address for the message. The return value is the number of bytes of non-ancillary data sent.\nThe following function sends the list of file descriptors fds over an AF_UNIX socket, on systems which support the SCM_RIGHTS mechanism. See also recvmsg().\nCopy\nimport socket, array\n\ndef send_fds(sock, msg, fds):\n    return sock.sendmsg([msg], [(socket.SOL_SOCKET, socket.SCM_RIGHTS, array.array(\"i\", fds))])\nAvailability: Unix, not WASI.\nMost Unix platforms.\nRaises an auditing event socket.sendmsg with arguments self, address.\nAdded in version 3.3.\nChanged in version 3.5: If the system call is interrupted and the signal handler does not raise an exception, the method now retries the system call instead of raising an InterruptedError exception (see PEP 475 for the rationale).\nsocket.sendmsg_afalg([msg, ]*, op[, iv[, assoclen[, flags]]])\nSpecialized version of sendmsg() for AF_ALG socket. Set mode, IV, AEAD associated data length and flags for AF_ALG socket.\nAvailability: Linux >= 2.6.38.\nAdded in version 3.6.\nsocket.sendfile(file, offset=0, count=None)\nSend a file until EOF is reached by using high-performance os.sendfile and return the total number of bytes which were sent. file must be a regular file object opened in binary mode. If os.sendfile is not available (e.g. Windows) or file is not a regular file send() will be used instead. offset tells from where to start reading the file. If specified, count is the total number of bytes to transmit as opposed to sending the file until EOF is reached. File position is updated on return or also in case of error in which case file.tell() can be used to figure out the number of bytes which were sent. The socket must be of SOCK_STREAM type. Non-blocking sockets are not supported.\nAdded in version 3.5.\nsocket.set_inheritable(inheritable)\nSet the inheritable flag of the socket’s file descriptor or socket’s handle.\nAdded in version 3.4.\nsocket.setblocking(flag)\nSet blocking or non-blocking mode of the socket: if flag is false, the socket is set to non-blocking, else to blocking mode.\nThis method is a shorthand for certain settimeout() calls:\nsock.setblocking(True) is equivalent to sock.settimeout(None)\nsock.setblocking(False) is equivalent to sock.settimeout(0.0)\nChanged in version 3.7: The method no longer applies SOCK_NONBLOCK flag on socket.type.\nsocket.settimeout(value)\nSet a timeout on blocking socket operations. The value argument can be a nonnegative floating-point number expressing seconds, or None. If a non-zero value is given, subsequent socket operations will raise a timeout exception if the timeout period value has elapsed before the operation has completed. If zero is given, the socket is put in non-blocking mode. If None is given, the socket is put in blocking mode.\nFor further information, please consult the notes on socket timeouts.\nChanged in version 3.7: The method no longer toggles SOCK_NONBLOCK flag on socket.type.\nsocket.setsockopt(level, optname, value: int)\nsocket.setsockopt(level, optname, value: buffer)\nsocket.setsockopt(level, optname, None, optlen: int)\nSet the value of the given socket option (see the Unix manual page setsockopt(2)). The needed symbolic constants are defined in this module (SO_* etc. <socket-unix-constants>). The value can be an integer, None or a bytes-like object representing a buffer. In the later case it is up to the caller to ensure that the bytestring contains the proper bits (see the optional built-in module struct for a way to encode C structures as bytestrings). When value is set to None, optlen argument is required. It’s equivalent to call setsockopt() C function with optval=NULL and optlen=optlen.\nChanged in version 3.5: Writable bytes-like object is now accepted.\nChanged in version 3.6: setsockopt(level, optname, None, optlen: int) form added.\nAvailability: not WASI.\nsocket.shutdown(how)\nShut down one or both halves of the connection. If how is SHUT_RD, further receives are disallowed. If how is SHUT_WR, further sends are disallowed. If how is SHUT_RDWR, further sends and receives are disallowed.\nAvailability: not WASI.\nsocket.share(process_id)\nDuplicate a socket and prepare it for sharing with a target process. The target process must be provided with process_id. The resulting bytes object can then be passed to the target process using some form of interprocess communication and the socket can be recreated there using fromshare(). Once this method has been called, it is safe to close the socket since the operating system has already duplicated it for the target process.\nAvailability: Windows.\nAdded in version 3.3.\nNote that there are no methods read() or write(); use recv() and send() without flags argument instead.\nSocket objects also have these (read-only) attributes that correspond to the values given to the socket constructor.\nsocket.family\nThe socket family.\nsocket.type\nThe socket type.\nsocket.proto\nThe socket protocol.\nNotes on socket timeouts\nA socket object can be in one of three modes: blocking, non-blocking, or timeout. Sockets are by default always created in blocking mode, but this can be changed by calling setdefaulttimeout().\nIn blocking mode, operations block until complete or the system returns an error (such as connection timed out).\nIn non-blocking mode, operations fail (with an error that is unfortunately system-dependent) if they cannot be completed immediately: functions from the select module can be used to know when and whether a socket is available for reading or writing.\nIn timeout mode, operations fail if they cannot be completed within the timeout specified for the socket (they raise a timeout exception) or if the system returns an error.\nNote\n \nAt the operating system level, sockets in timeout mode are internally set in non-blocking mode. Also, the blocking and timeout modes are shared between file descriptors and socket objects that refer to the same network endpoint. This implementation detail can have visible consequences if e.g. you decide to use the fileno() of a socket.\nTimeouts and the connect method\nThe connect() operation is also subject to the timeout setting, and in general it is recommended to call settimeout() before calling connect() or pass a timeout parameter to create_connection(). However, the system network stack may also return a connection timeout error of its own regardless of any Python socket timeout setting.\nTimeouts and the accept method\nIf getdefaulttimeout() is not None, sockets returned by the accept() method inherit that timeout. Otherwise, the behaviour depends on settings of the listening socket:\nif the listening socket is in blocking mode or in timeout mode, the socket returned by accept() is in blocking mode;\nif the listening socket is in non-blocking mode, whether the socket returned by accept() is in blocking or non-blocking mode is operating system-dependent. If you want to ensure cross-platform behaviour, it is recommended you manually override this setting.\nExample\nHere are four minimal example programs using the TCP/IP protocol: a server that echoes all data that it receives back (servicing only one client), and a client using it. Note that a server must perform the sequence socket(), bind(), listen(), accept() (possibly repeating the accept() to service more than one client), while a client only needs the sequence socket(), connect(). Also note that the server does not sendall()/recv() on the socket it is listening on but on the new socket returned by accept().\nThe first two examples support IPv4 only.\nCopy\n# Echo server program\nimport socket\n\nHOST = ''                 # Symbolic name meaning all available interfaces\nPORT = 50007              # Arbitrary non-privileged port\nwith socket.socket(socket.AF_INET, socket.SOCK_STREAM) as s:\n    s.bind((HOST, PORT))\n    s.listen(1)\n    conn, addr = s.accept()\n    with conn:\n        print('Connected by', addr)\n        while True:\n            data = conn.recv(1024)\n            if not data: break\n            conn.sendall(data)\nCopy\n# Echo client program\nimport socket\n\nHOST = 'daring.cwi.nl'    # The remote host\nPORT = 50007              # The same port as used by the server\nwith socket.socket(socket.AF_INET, socket.SOCK_STREAM) as s:\n    s.connect((HOST, PORT))\n    s.sendall(b'Hello, world')\n    data = s.recv(1024)\nprint('Received', repr(data))\nThe next two examples are identical to the above two, but support both IPv4 and IPv6. The server side will listen to the first address family available (it should listen to both instead). On most of IPv6-ready systems, IPv6 will take precedence and the server may not accept IPv4 traffic. The client side will try to connect to all the addresses returned as a result of the name resolution, and sends traffic to the first one connected successfully.\nCopy\n# Echo server program\nimport socket\nimport sys\n\nHOST = None               # Symbolic name meaning all available interfaces\nPORT = 50007              # Arbitrary non-privileged port\ns = None\nfor res in socket.getaddrinfo(HOST, PORT, socket.AF_UNSPEC,\n                              socket.SOCK_STREAM, 0, socket.AI_PASSIVE):\n    af, socktype, proto, canonname, sa = res\n    try:\n        s = socket.socket(af, socktype, proto)\n    except OSError as msg:\n        s = None\n        continue\n    try:\n        s.bind(sa)\n        s.listen(1)\n    except OSError as msg:\n        s.close()\n        s = None\n        continue\n    break\nif s is None:\n    print('could not open socket')\n    sys.exit(1)\nconn, addr = s.accept()\nwith conn:\n    print('Connected by', addr)\n    while True:\n        data = conn.recv(1024)\n        if not data: break\n        conn.send(data)\nCopy\n# Echo client program\nimport socket\nimport sys\n\nHOST = 'daring.cwi.nl'    # The remote host\nPORT = 50007              # The same port as used by the server\ns = None\nfor res in socket.getaddrinfo(HOST, PORT, socket.AF_UNSPEC, socket.SOCK_STREAM):\n    af, socktype, proto, canonname, sa = res\n    try:\n        s = socket.socket(af, socktype, proto)\n    except OSError as msg:\n        s = None\n        continue\n    try:\n        s.connect(sa)\n    except OSError as msg:\n        s.close()\n        s = None\n        continue\n    break\nif s is None:\n    print('could not open socket')\n    sys.exit(1)\nwith s:\n    s.sendall(b'Hello, world')\n    data = s.recv(1024)\nprint('Received', repr(data))\nThe next example shows how to write a very simple network sniffer with raw sockets on Windows. The example requires administrator privileges to modify the interface:\nCopy\nimport socket\n\n# the public network interface\nHOST = socket.gethostbyname(socket.gethostname())\n\n# create a raw socket and bind it to the public interface\ns = socket.socket(socket.AF_INET, socket.SOCK_RAW, socket.IPPROTO_IP)\ns.bind((HOST, 0))\n\n# Include IP headers\ns.setsockopt(socket.IPPROTO_IP, socket.IP_HDRINCL, 1)\n\n# receive all packets\ns.ioctl(socket.SIO_RCVALL, socket.RCVALL_ON)\n\n# receive a packet\nprint(s.recvfrom(65565))\n\n# disabled promiscuous mode\ns.ioctl(socket.SIO_RCVALL, socket.RCVALL_OFF)\nThe next example shows how to use the socket interface to communicate to a CAN network using the raw socket protocol. To use CAN with the broadcast manager protocol instead, open a socket with:\nCopy\nsocket.socket(socket.AF_CAN, socket.SOCK_DGRAM, socket.CAN_BCM)\nAfter binding (CAN_RAW) or connecting (CAN_BCM) the socket, you can use the socket.send() and socket.recv() operations (and their counterparts) on the socket object as usual.\nThis last example might require special privileges:\nCopy\nimport socket\nimport struct\n\n\n# CAN frame packing/unpacking (see 'struct can_frame' in <linux/can.h>)\n\ncan_frame_fmt = \"=IB3x8s\"\ncan_frame_size = struct.calcsize(can_frame_fmt)\n\ndef build_can_frame(can_id, data):\n    can_dlc = len(data)\n    data = data.ljust(8, b'\\x00')\n    return struct.pack(can_frame_fmt, can_id, can_dlc, data)\n\ndef dissect_can_frame(frame):\n    can_id, can_dlc, data = struct.unpack(can_frame_fmt, frame)\n    return (can_id, can_dlc, data[:can_dlc])\n\n\n# create a raw socket and bind it to the 'vcan0' interface\ns = socket.socket(socket.AF_CAN, socket.SOCK_RAW, socket.CAN_RAW)\ns.bind(('vcan0',))\n\nwhile True:\n    cf, addr = s.recvfrom(can_frame_size)\n\n    print('Received: can_id=%x, can_dlc=%x, data=%s' % dissect_can_frame(cf))\n\n    try:\n        s.send(cf)\n    except OSError:\n        print('Error sending CAN frame')\n\n    try:\n        s.send(build_can_frame(0x01, b'\\x01\\x02\\x03'))\n    except OSError:\n        print('Error sending CAN frame')\nRunning an example several times with too small delay between executions, could lead to this error:\nCopy\nOSError: [Errno 98] Address already in use\nThis is because the previous execution has left the socket in a TIME_WAIT state, and can’t be immediately reused.\nThere is a socket flag to set, in order to prevent this, socket.SO_REUSEADDR:\nCopy\ns = socket.socket(socket.AF_INET, socket.SOCK_STREAM)\ns.setsockopt(socket.SOL_SOCKET, socket.SO_REUSEADDR, 1)\ns.bind((HOST, PORT))\nthe SO_REUSEADDR flag tells the kernel to reuse a local socket in TIME_WAIT state, without waiting for its natural timeout to expire.\npcpp::RawSocketDevice Class Reference\n#include <RawSocketDevice.h>\nInheritance diagram for pcpp::RawSocketDevice:\n\n\nDetailed Description\nA class that wraps the raw socket functionality. A raw socket is a network socket that allows direct sending and receiving of IP packets without any protocol-specific transport layer formatting (taken from Wikipedia: https://en.wikipedia.org/wiki/Network_socket#Raw_socket). This wrapper class enables creation of a raw socket, binding it to a network interface, and then receiving and sending packets on it. Current implementation supports only Windows and Linux because other platforms provide poor support for raw sockets making them practically unusable. There are also major differences between Linux and Windows in raw socket implementation, let's mention some of the:\nOn Windows administrative privileges are required for raw sockets creation, meaning the process running the code has to have these privileges. In Linux 'sudo' is required\nOn Windows raw sockets are implemented in L3, meaning the L2 (Ethernet) layer is omitted by the socket and only L3 and up are visible to the user. On Linux raw sockets are implemented on L2, meaning all layers (including the Ethernet data) are visible to the user.\nOn Windows sending packets is not supported, a raw socket can only receive packets. On Linux both send and receive are supported\nLinux doesn't require binding to a specific network interface for receiving packets, but it does require binding for sending packets. Windows requires binding for receiving packets. For the sake of keeping a unified and simple cross-platform interface this class requires binding for both Linux and Windows, on both send and receive\nMore details about opening the raw socket, receiving and sending packets are explained in the corresponding class methods. Raw sockets are supported for both IPv4 and IPv6, so you can create and bind raw sockets to each of the two. Also, there is no limit on the number of sockets opened for a specific IP address or network interface, so you can create multiple instances of this class and bind all of them to the same interface and IP address.\nMember Enumeration Documentation\n◆ RecvPacketResult\nAn enum for reporting packet receive results\nConstructor & Destructor Documentation\n◆ ~RawSocketDevice()\nA d'tor for this class. It closes the raw socket if not previously closed by calling close()\nMember Function Documentation\n◆ close()\nClose the raw socket\nImplements pcpp::IDevice.\n◆ open()\nOpen the device by creating a raw socket and binding it to the network interface specified in the c'tor\nReturns\nTrue if device was opened successfully, false otherwise with a corresponding error log message\nImplements pcpp::IDevice.\n◆ receivePacket()\nReceive a packet on the raw socket. This method has several modes of operation:\nBlocking/non-blocking - in blocking mode the method will not return until a packet is received on the socket or until the timeout expires. In non-blocking mode it will return immediately and in case no packets are on the receive queue RawSocketDevice::RecvWouldBlock will be returned. Unless specified otherwise, the default value is blocking mode\nReceive timeout - in blocking mode, the user can set a timeout to wait until a packet is received. If the timeout expires and no packets were received, the method will return RawSocketDevice::RecvTimeout. The default value is a negative value which means no timeout\nThere is a slight difference on this method's behavior between Windows and Linux around how packets are received. On Linux the received packet contains all layers starting from the L2 (Ethernet). However on Windows raw socket are integrated in L3 level so the received packet contains only L3 (IP) layer and up.\nParameters\nReturns\nThe method returns one on the following values:\nRawSocketDevice::RecvSuccess is returned if a packet was received successfully\nRawSocketDevice::RecvTimeout is returned if in blocking mode and timeout expired\nRawSocketDevice::RecvWouldBlock is returned if in non-blocking mode and no packets were captured\nRawSocketDevice::RecvError is returned if an error occurred such as device is not opened or the recv operation returned some error. A log message will be followed specifying the error and error code\n◆ receivePackets()\nReceive packets into a packet vector for a certain amount of time. This method starts a timer and invokes the receivePacket() method in blocking mode repeatedly until the timeout expires. All packets received successfully are put into a packet vector\nParameters\nReturns\nThe number of packets received successfully\n◆ sendPacket()\nSend an Ethernet packet to the network. L2 protocols other than Ethernet are not supported in raw sockets. The entire packet is sent as is, including the original Ethernet and IP data. This method is only supported in Linux as Windows doesn't allow sending packets from raw sockets. Using it from other platforms will also return \"false\" with a corresponding error log message\nParameters\nReturns\nTrue if packet was sent successfully or false if the socket is not open, if the packet is not Ethernet or if there was a failure sending the packet\n◆ sendPackets()\nSend a set of Ethernet packets to the network. L2 protocols other than Ethernet are not supported by raw sockets. The entire packet is sent as is, including the original Ethernet and IP data. This method is only supported in Linux as Windows doesn't allow sending packets from raw sockets. Using it from other platforms will return \"false\" with an appropriate error log message\nParameters\nReturns\nThe number of packets sent successfully. For packets that weren't sent successfully there will be a corresponding error message printed to log\n",
  "context": "\n\n👉 Explanation",
  "source_file": "resources\\Year 3\\Socket Programming\\Raw Socket.docx",
  "line_numbers": [
    741,
    1829
  ]
}